[{"tweet": "\"Lies can go viral. But so can the truth.\" A valuable point : With control of the House, Dems can spread facts & accurate findings to counter & friends' lies & distortions. Fits w/my column today arguing for an immigration argument rooted in reason, not fear …", "timestamp": "1546294364"}, {"tweet": "Trump \"Our schools are essentially gun-free zones and that makes them very dangerous places\" RT if you think is a lunatic.", "timestamp": "1546283779"}, {"tweet": "I, Walking Hippo, do appoint this upcoming New Year’s Day and every New Year’s Day henceforth as: A Day Without A So I don’t want to see a Trump, hear about a Trump, listen to a Trump, for the first new day of the year. Now that’s the good foot!", "timestamp": "1546299704"}, {"tweet": "To all My friends On, A Happy And a prayer For a trussed And a busted And peace on earth For all, And for a planet God bless, Andy", "timestamp": "1546297370"}, {"tweet": "This sketch on is the most cringe thing. Who the fuck okayed this!?", "timestamp": "1546298890"}, {"tweet": "Join us as we reflect on yet another year of PROMISES MADE and PROMISES KEPT. With all that we've accomplished, we know that 2019 is going to be bigger and better than ever before! WATCH: …", "timestamp": "1546294192"}, {"tweet": "Hey tax cuts really ignited the, huh?... Congrats on the WORST year in 10 years. Humiliating... …", "timestamp": "1546291374"}, {"tweet": "GoFundMe campaigns for tunnels & ladders to sabotage's wall get almost $160K in total – campaign helping to build it collects more than $18mn in 14 days", "timestamp": "1546296000"}, {"tweet": "All you ever needed to know about in 18 seconds …", "timestamp": "1546297548"}, {"tweet": "And the last day of 2018 ended green, despite the bloodbath of 2018. The year where predictions of $100 oil turned false! And all forecasts failures were blamed on.. the easiest and the most believable excuse.", "timestamp": "1546295859"}, {"tweet": "A Knee for Trump I’m not a praying person, but I’ve decided to pray for Trump, pray he opens his heart to people, learns compassion.", "timestamp": "1546296431"}, {"tweet": "We are celebrating the end of 2018 and the beginning of the end of the presidency. Out for dinner and a movie with my kiddo on a rain-soaked New Year’s Eve. Magical.", "timestamp": "1546300278"}, {"tweet": "Many people are saying you're that you're not there. That you actually snuck out of DC like a thief and are collecting your BIGLY fees at for your party. Prove them wrong. Walk out of the Oval Office outside door right now. I dare ya...", "timestamp": "1546291142"}, {"tweet": "That’s all folks. Game over for 2018. Worst year in a decade. Thanks to all of the incompetent people running our country for destroying trillions in wealth during the strongest economy in decades.", "timestamp": "1546291255"}, {"tweet": "He's My President DJ Burn Go watch the full video http://DJBURN.NET", "timestamp": "1546289273"}, {"tweet": "Happy New Year, my friends. Now that government workers have \"joined\" our teachers, thanks to & his enablers, we will need to work even harder to 'right the ship' & help every", "timestamp": "1546294859"}, {"tweet": "So everyone who voted for for his financial acumen & ability to move the stock market? I’m sure u didn’t think it would go down to the 2008 levels, did u? Congrats & thx for ruining so many people’s retirement funds.", "timestamp": "1546295287"}, {"tweet": "Government shutdown continues", "timestamp": "1546296287"}, {"tweet": "Trump gave the army up to 120 days to withdraw from. Many details are still unclear and officials recognize that Trump could change his mind at any moment and speed up the withdrawal.", "timestamp": "1546294993"}, {"tweet": "Trump’s decision to withdraw from is the most valuable New Year’s gift that he could possibly give,, &. What on earth did he base his decision on. From every respect there seems to be absolutely no good that could possibly come out of", "timestamp": "1546286714"}, {"tweet": "He was not found innocent and there is a good reason for the spotlight to be on is as crooked as they come as was his father. The Trump family are nothing more than grandiose grifters, all of them", "timestamp": "1546296305"}, {"tweet": "I legitimately need a supporter or to explain to me how it’s Democrat’s fault that congress won’t grant the money to build the wall Trump swore Mexico was going to pay for. No fighting. Serious question. Please help me understand.", "timestamp": "1546295198"}, {"tweet": "The Market had the worst year since 2008. killed a healthy market in less than 2 years. He wants a, I want the money I lost from my.", "timestamp": "1546299238"}, {"tweet": "Yola Carter on was pure class. No need for the impersonator. Completely out of place.", "timestamp": "1546299248"}, {"tweet": "Is it just me, or is Louis C.K. auditioning for a position in the Trump administration?", "timestamp": "1546292102"}, {"tweet": "Reality is that has one call from heads of other countries.", "timestamp": "1546298696"}, {"tweet": "“Trump apparently faced a steep. But it turns out that he has no learning curve, because he is incapable of learning.” “His brain is shielded by a concrete that repels any unwelcome facts or obligations.” …", "timestamp": "1546291960"}, {"tweet": "Sorry, America : Canada and 5 other nations pull trigger on world’s biggest trade deal — leaving America out in the cold …", "timestamp": "1546292907"}, {"tweet": "DumpTrump .. I Actually Considered When I Wrote My Tweet .. Is SO Corrupt .. I'm Watching For Comfort This …", "timestamp": "1546289152"}, {"tweet": "BREAKING: FAA suggests a visit to the city of Thursday. Speculation it may be president after last week’s announcement he will visit the region for a groundbreaking ?nid=8247 …", "timestamp": "1546287706"}, {"tweet": "Earlier this year, I wrote for how an oversight storm could paralyze the presidency … now just days away from taking control, Democrats are in a position to hold and his cronies accountable …", "timestamp": "1546284780"}, {"tweet": "2018 what a year for his two great triumphs electing Pres and passed relentlessly destroying - proves for evil to triump only requires good people to do nothing?", "timestamp": "1546290398"}, {"tweet": "Trump: is worth re-reading from August on why Trump supporters see him not as corrupt, but as combating the 'corruption' of traditional racial/gender …", "timestamp": "1546290585"}, {"tweet": "Workable Compromise... Consider supporting my cartoons on my Patreon Page so I can continue creating them. …", "timestamp": "1546294693"}, {"tweet": "one day we will need our allies and I hope your in office when that day comes because I wouldn't blame them for us!", "timestamp": "1546294491"}, {"tweet": ".SigiMideast Unlike 9/11 when American political establishment was mostly unified in quest to preserve US-Saudi partnership, consensus in Congress now is business as usual—as defined by the presidency of Donald—cannot continue.", "timestamp": "1546291714"}, {"tweet": "China says it is 'ready to work with US' …", "timestamp": "1546297042"}, {"tweet": "For 2018, has his first meeting, on average, at 11:18 am. has the latest start for any President since 1933, and the shortest office time. Analysis, cohort, and shared data: …", "timestamp": "1546295190"}, {"tweet": "No matter who you support for 2020, I think is threatened by humanity … wrote this piece at the end of March for explaining why Joe’s emotional authenticity drives crazy …", "timestamp": "1546292100"}, {"tweet": "The AFGE WON the last lawsuit against when he tried to take away their collective bargaining rights! Trump now wants to try the same thing to the", "timestamp": "1546300665"}]